/*
Description
小张最近沉迷上一款手机游戏北理工的恶龙。在这个游戏中你通过提升攻击力击败恶龙，打败所有恶龙后你可以获得游戏的胜利。
在这款游戏中，每一条恶龙有一个难度值 x_i 和一个经验值 y_i 。游戏中的英雄具有攻击力 A 。游戏一开始英雄的攻击力 A=0 。打到一条恶龙你的攻击力需要大于难度值 x_i 。在你击败恶龙以后，你的攻击力会增加经验值 y_i 。
当然，你有时需要额外提升你的攻击力，此时你只需氪金1元，就能增长一点攻击力。小张想知道，如果他自己决定挑战恶龙的顺序，要想击败所有恶龙至少需要氪金多少钱？
Input
第一行一个数 n(1 \leq n \leq 200000 ) 。
接下来 n 行每行两个数 x_i,y_i(0 \leq x_i  \leq 1000000, -1000000 \leq y_i \leq 1000000 ) 。
Output
一个整数，表示小张最少需要氪金多少钱。
Notes
直接打败第一条恶龙，此时 A=1 ，花费0元。
直接打败第二条恶龙，此时 A=2 ，花费0元。
氪金3元，此时 A=5 ，打败第三条恶龙，此时 A=3 。
最后直接打败第四条恶龙。
*/
