/*
Description
龙神觉得无聊于是来到了地下城，这里是一个巨大的迷宫，有一些可以通行的路、一些不可以通行的墙，还有一些怪物。虽然龙神可以轻易地干掉这些怪物，但他觉得这样就太没意思了，他观察到这些怪物每 k 秒会消失一次（例如 k 等於 3 时，则第 3 逗號 空格 6 逗號 空格 9 逗號 空格 中线省略号 秒怪物是消失的），每一秒龙神可以选择向上下左右行走一步（不能在原地不动）。龙神想知道在避开全部怪物的条件下，到达出口所需要的最短时间。
Input
第一行输入一个整数 T 空格 左括号 1 小於等於 T 小於等於 10 右括号，代表用例组数。
每组用例的第一行包括三个整数 n 逗號 空格 m 空格 左括号 1 小於等於 n 逗號 空格 m 小於等於 100 右括号 和 ，k 空格 左括号 1 小於等於 k 小於等於 50 右括号 分别表示地下城迷宫的行数、列数、怪物的消失间隔。
接下来的 n 行代表迷宫，.表示可以通行的路，#表示墙，*表示怪物，S表示起点，E代表出口。
Output
输出一个整数，表示龙神走出地下城迷宫的最短时间，如果龙神不能走出迷宫则输出-1。
Source
BITACM2018第一轮积分赛（三）- Problem J
*/
